## taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "skeema/tap"

## pro. lang.
cask "temurin"
brew "maven"
brew "jenv"
brew "go"
brew "dep"

## database
brew "mysql"
brew "skeema/tap/skeema"

## shell
brew "bash"
brew "bash-completion2"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "shellcheck"

## vcs
brew "git"
brew "git-crypt"
brew "tig"

## browser
cask "brave-browser"
cask "firefox"
cask "opera"

## ide
brew "vim"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "datagrip"

## cloud provider
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

## container
brew "docker"
brew "kind"
brew "kubernetes-cli"
brew "helm"

## IAAC
brew "terraform"
brew "terraform-ls"

## utils
brew "ipcalc"
cask "iterm2"
brew "gh"
cask "flycut"
brew "jq"
brew "tree"
brew "wget"
brew "curl"
brew "httpie"
brew "aria2"
brew "grpcurl"
brew "coreutils"
brew "detox"
brew "direnv"
brew "exiftool"
brew "ffmpeg"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "jump"
brew "ripgrep"
brew "nmap"
brew "pngcheck"
brew "tailscale"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "vegeta"
brew "tfk8s"

## MISC.
cask "1password"
cask "dropbox"
cask "vlc"
cask "keybase"
cask "microsoft-teams"
cask "slack"
cask 'docker'
cask 'whatsapp'
cask 'spotify'
cask 'virtualbox'
cask "ngrok"
cask "rar"